<?php


namespace App;

/**
 * Class Translation
 * @package App
 */
class Translation
{
    /**
     * @return \string[][]
     */
    public static function messages() : array
    {
        return [
            'ru' => [
                'greeting' => '👋 Здравствуйте, я бот, который поможет вам рассчитать сумму страхового полиса, хотите продолжить?',
                'yes' => '👌 Да',
                'iin_question' => '🗒️ Введите ИИН:',
                'vehicle_question' => '🚗 Введите гос номер автомобиля:',
                'answer' => '💰 Стоимость страхового полиса составляет:',
                'iin_error' => '⚠️ ИИН должен содержать 12 цифр!',
                'try_again' => '😊 Попробуйте снова',
                'notice' => '*Продолжая, вы соглашаетесь на сбор информации!',
                'experience_question' => '🗒️ Введите стаж вождения:',
            ],
            'kz' => [
                'greeting' => '👋 Сәлеметсіз бе, мен сізге сақтандыру полисінің мөлшерін есептеуге көмектесетін ботпын, жалғастырғыңыз келе ме?',
                'yes' => '👌 Ия',
                'iin_question' => '🗒️ ЖСН енгізіңіз:',
                'vehicle_question' => '🚗 Көліктің мемлекеттік нөмірін енгізіңіз:',
                'answer' => '💰 Сақтандыру полисінің құны:',
                'iin_error' => '⚠️ ЖСН 12 цифрдан тұруы керек!',
                'try_again' => '😊 Тағы да қайталап көріңіз',
                'notice' => '*Жалғастыру арқылы сіз ақпарат жинауға келісесіз!',
                'experience_question' => '🗒️ Жүргізу тәжірибесін енгізіңіз:',
            ]
        ];
    }
}