<?php


namespace App;

/**
 * Class Translation
 * @package App
 */
class Translation
{
    /**
     * @return \string[][]
     */
    public static function messages() : array
    {
        return [
            'ru' => [
                'greeting' => '👋 Здравствуйте, я бот, который поможет вам рассчитать сумму страхового полиса, хотите продолжить?',
                'yes' => '👌 Да',
                'no'  => '✋ Нет',
                'iin_question' => '🗒️ Введите ИИН:',
                'vehicle_question' => '🚗 Введите гос номер автомобиля:',
                'answer' => '💰 Стоимость страхового полиса составляет:',
                'data' => '📌 Данные по водителям',
                'iin_error' => '⚠️ ИИН должен содержать 12 цифр!',
                'vehicle_error' => '⚠️ Корректно введите гос номер!',
                'try_again' => '😊 Попробуйте снова',
                'notice' => '*Продолжая, вы соглашаетесь на сбор информации!',
                'experience_question' => '🚗 Введите стаж вождения:',
                'experience_more' => 'Более 2 лет',
                'experience_less' => 'Менее 2 лет',
                'number_question' => '🗒️ Отправьте свой номер, чтобы наши консультанты связались с вами!',
                'number' => 'Отправить мой контакт',
                'submit_number' => '👐 Спасибо что поделились номером, совсем скоро наши консультанты свяжутся с вами!',
                'name' => 'Имя: ',
                'iin'  => '🗒 ИИН: ',
                'ts'   => '🚗 ТС: ',
                'summa'=> '💰 Сумма: ',
                'mobile'=>'🗒️ Телефон: ',
                'drivers_count' => '👮 Хотите ли вы добавить еще водителя? ',
                'drivers_add' => 'Добавить водителя',
                'driver_one' => 'Далее',
                'class_bm' => '🛡 Класс безаварийности: ',
                'restart'      => 'Нажмите Рассчитать еще, чтобы узнать сумму страхового полиса',
                'iin_request' => '⚠ Данный ИИН нет на нашей базе',
                'vehicles_count' => '🚗 Хотите ли вы добавить еще транспортных средств? ',
                'vehicle_add' => 'Добавить транспортное средство',
                'vehicle_one' => 'Далее',
                'bonus'     =>      '🔝 Хотите получить бонус к страховому полису с экономией до 30% ?',
                'bonus_pdf' =>      '👐 Так же бонусом отправляем вам таблицу штрафов ПДД 2021',
                'instagram' =>      '📸 Подписывайтесь на наш инстаграм АвтоАдвокат',
                'table_gif'     =>  "🔝 Хотели бы получить 'Таблицу штрафов ПДД2021' с изменениями?",
                'thanks_manager'=>  '👐 Спасибо! Наш менеджер свяжется с Вами в течении 5 - 10 минут',
                'upload_table'  =>  "📌 Выгрузка pdf файла 'Таблица Штрафов ПДД2021'",
                'number_table'  =>  "🗒️ Отправьте свой номер, чтобы получить 'Таблицу Штрафов ПДД2021'",
                'yes_without'   =>  'Да',
                'no_without'    =>  'Нет',
                'repeat_iin'    =>  '🛡 Вы уже ввели такой ИИН ',

            ],
            'kz' => [
                'greeting' => '👋 Сәлеметсіз бе, мен сізге сақтандыру полисінің мөлшерін есептеуге көмектесетін ботпын, жалғастырғыңыз келе ме?',
                'yes' => '👌 Ия',
                'no'  => '✋ Жоқ',
                'iin_question' => '🗒️ ЖСН енгізіңіз:',
                'data' => '📌 Жүргізуші туралы мәліметтер',
                'vehicle_question' => '🚗 Көліктің мемлекеттік нөмірін енгізіңіз:',
                'answer' => '💰 Сақтандыру полисінің құны:',
                'iin_error' => '⚠️ ЖСН 12 цифрдан тұруы керек!',
                'vehicle_error' => '⚠️ Мемлекеттік нөмірді дұрыс енгізіңіз!!',
                'try_again' => '😊 Тағы да қайталап көріңіз',
                'notice' => '*Жалғастыру арқылы сіз ақпарат жинауға келісесіз!',
                'experience_question' => '🚗 Жүргізу тәжірибесін енгізіңіз:',
                'experience_more' => '2 жылдан астам',
                'experience_less' => '2 жылдан кем',
                'number_question' => '🗒️ Біздің кеңесшілер сізбен байланысу үшін нөміріңізді жіберіңіз!',
                'number' => 'Менің нөмерімді жіберу',
                'submit_number' => '👐 Нөміріңізді жібергеніңіз үшін рақмет, жақын арада біздің кеңесшілер сізбен байланысады!',
                'name' => 'Имя: ',
                'iin'  => '🗒 ИИН: ',
                'ts'   => '🚗 ТС: ',
                'summa'=> '💰 Сумма: ',
                'drivers_add' => 'Жүргізуші қосу',
                'driver_one' => 'Жалғастыру',
                'drivers_count' => '👮 Тағы жүргізуші қосқыныз келеді ме? ',
                'mobile'=>'🗒️ Телефон: ',
                'restart'      => 'Сақтандыру полисінің мөлшерін білу үшін Толығырақ есептеу түймесін басыңыз',
                'class_bm'  =>  '🛡 Класс безаварийности: ',
                'iin_request' => '⚠ Бұл ЖСН біздің мәліметтер базасында жоқ',
                'vehicles_count' => '🚗 Қосымша көлік қосқыңыз келе ме? ',
                'vehicle_add' => 'Қосымша көлік қосу',
                'vehicle_one' => 'Жалғастыру',
                'bonus'     =>      '🔝 Сақтандыру полисіңізге 30% дейін үнемдеу арқылы бонус алғыңыз келе ме?',
                'bonus_pdf' =>      '👐 Рақмет сізге! Біз сізге бонус ретінде 2021 жол қозғалысы айыппұлдарының кестесін жібереміз.',
                'instagram' =>      '📸 Біздің Instagram АвтоАдвокат жазылыңыз',
                'table_gif'     =>  "🔝 Өзгерістер енгізілген 'Жол ережелері бойынша айыппұлдар кестесін2021' алғыңыз келе ме?",
                'thanks_manager'=>  '👐 Рақмет! Біздің менеджер сізге 5-10 минут ішінде хабарласады',
                'upload_table'  =>  '📌 Кесте жіберілуде',
                'number_table'  =>  "🗒️ Нөміріңізді «айыппұлдар кестесі бойынша қозғалыс ережелері 2021» алу үшін жіберіңіз.",
                'yes_without'   =>  'Иа',
                'no_without'    =>  'Жоқ',
                'repeat_iin'    =>  '🛡 Сіз бұл ЖСН-ді енгізіп алдыңыз',
            ]
        ];
    }
}